---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.DeletePreventedByGroup
source: html/48d3b14d-6827-cb68-797f-2ebf8aaa11e1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.DeletePreventedByGroup Property

Grouped elements can only be deleted when the group is being edited. To delete a member select the group and then click the Edit Group button on the toolbar, then delete the member.

## Syntax (C#)
```csharp
public static FailureDefinitionId DeletePreventedByGroup { get; }
```